README.md
```mermaid
erDiagram
  CATEGORIA {
    int id_categoria PK
    varchar nombre
  }
  PROVEEDOR {
    int id_proveedor PK
    varchar nombre
    varchar telefono
    varchar email
  }
  PRODUCTO {
    int id_producto PK
    varchar nombre
    varchar descripcion
    decimal precio
    int stock
    int stock_minimo
    int id_categoria FK
    int id_proveedor FK
  }

  CATEGORIA ||--o{ PRODUCTO : "categoriza"
  PROVEEDOR ||--o{ PRODUCTO : "suministra"
```
